{
  "word": "berkshire",
  "pronunciation": "bɜːrk·ʃər",
  "concise_definition": "n. 白金汉郡（英国地名）, 伯克希尔（美国地名）",
  "forms": {
    "plural": "Berkshires"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A historic county in south-central England, known for its rolling hills, historic estates, and cultural heritage, including the town of Reading and the Berkshire Hathaway headquarters.",
      "explanation_cn": "位于英格兰中南部的一个历史悠久的郡，以其连绵的丘陵、历史悠久的庄园和文化遗产而闻名，包括雷丁镇以及伯克希尔·哈撒韦公司的总部所在地。",
      "example_en": "The annual Berkshire Hathaway shareholders meeting draws thousands to Omaha, Nebraska.",
      "example_cn": "每年的伯克希尔·哈撒韦公司股东大会都会吸引数千人前往内布拉斯加州的奥马哈。"
    },
    {
      "pos": "noun",
      "explanation_en": "A region in western Massachusetts, USA, known for its scenic beauty, arts communities, and educational institutions such as Williams College and the Massachusetts Museum of Contemporary Art.",
      "explanation_cn": "美国马萨诸塞州西部的一个地区，以其风景优美、艺术社群以及威廉姆斯学院和马萨诸塞州当代艺术博物馆等教育机构而著称。",
      "example_en": "Many artists and writers have found inspiration in the quiet valleys of the Berkshires.",
      "example_cn": "许多艺术家和作家都在伯克希尔的宁静山谷中找到了灵感。"
    },
    {
      "pos": "noun",
      "explanation_en": "A breed of domestic pig, originally from Berkshire, England, known for its black coat with white points and high-quality meat.",
      "explanation_cn": "一种原产于英国伯克郡的家猪品种，以其黑色被毛配白色四肢和优质肉质而闻名。",
      "example_en": "The Berkshire pig is prized by gourmet chefs for its rich, marbled flavor.",
      "example_cn": "伯克希尔猪因其肉质丰富、大理石纹路明显而受到高级厨师的青睐。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "county",
      "analysis": "“County”（郡）是一个行政地理单位，泛指国家内部的次级行政区划，如英国的郡或美国的县。而 “Berkshire” 是一个具体的地名，特指英格兰或马萨诸塞州的特定区域，具有文化、历史和经济上的独特性，不能与其他郡随意互换。"
    },
    {
      "word_to_compare": "shire",
      "analysis": "“Shire” 是古英语中表示“郡”的后缀，常用于英国地名（如 Hampshire, Yorkshire），本身不构成独立地名，必须与前缀结合。“Berkshire” 是完整地名，由 “Berk”（古地名）+ “shire” 构成，因此它是一个专有名词，而 “shire” 是构词成分。"
    },
    {
      "word_to_compare": "Hathaway",
      "analysis": "“Hathaway” 是一个姓氏，因伯克希尔·哈撒韦公司（Berkshire Hathaway）而广为人知，但它本身不是地理名称。而 “Berkshire” 是地名，也是公司名称的组成部分，二者在语义上完全不同：前者是地点，后者是人名。"
    }
  ]
}