{
  "word": "between",
  "pronunciation": "bi·twēn",
  "concise_definition": "prep. 在…之间, 在…中间",
  "definitions": [
    {
      "pos": "preposition",
      "explanation_en": "Indicating the position or location of something that is situated in the space or time separating two or more distinct points, objects, or entities.",
      "explanation_cn": "表示某物位于两个或多个明确的点、物体或实体之间的空间或时间范围内。",
      "example_en": "The cat sat between the two chairs.",
      "example_cn": "猫坐在两把椅子之间。"
    },
    {
      "pos": "preposition",
      "explanation_en": "Denoting a relationship or connection involving two or more parties, often implying choice, comparison, or interaction.",
      "explanation_cn": "表示涉及两个或多个主体之间的关系，常暗示选择、比较或互动。",
      "example_en": "There is a strong bond between siblings.",
      "example_cn": "兄弟姐妹之间有着深厚的感情。"
    },
    {
      "pos": "preposition",
      "explanation_en": "Used to indicate a range or interval, especially when referring to numbers, time periods, or options.",
      "explanation_cn": "用于表示一个范围或间隔，尤其指数字、时间段或选项之间的区间。",
      "example_en": "The meeting is scheduled between 2 and 4 p.m.",
      "example_cn": "会议安排在下午两点到四点之间。"
    },
    {
      "pos": "preposition",
      "explanation_en": "Expressing a state of uncertainty or indecision among two or more alternatives.",
      "explanation_cn": "表示在两个或多个选择之间犹豫不决或处于不确定状态。",
      "example_en": "She was between jobs when she moved to the city.",
      "example_cn": "她搬家到这座城市时正处于两份工作之间的空档期。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "among",
      "analysis": "“Among”（在…之中）用于三个或三个以上的事物之间，强调的是群体内部的模糊关系，不突出个体间的界限。而 “between” 通常用于两个事物之间，或明确区分的多个事物之间，强调个体之间的具体关系。例如：‘The treasure was divided among the three pirates’（宝藏在三个海盗之间分配），但 ‘The agreement was signed between the two companies’（协议在两家公司之间签署）。"
    },
    {
      "word_to_compare": "in",
      "analysis": "“In”（在…里面）表示某物位于一个封闭或包含性的空间内，强调的是内部位置。而 “between” 强调的是两个或多个外部实体之间的间隙或间隔，不包含在任一实体内部。例如：‘The book is in the box’（书在盒子里）vs. ‘The book is between the box and the table’（书在盒子和桌子之间）。"
    },
    {
      "word_to_compare": "amongst",
      "analysis": "“Amongst” 是 “among” 的英式英语变体，语义和用法完全相同，仅在语体和地域使用上略有差异。它比 “between” 更少用于明确的二元关系，且语气更正式或文学化。在现代美式英语中，“amongst” 已极少使用，而 “between” 则广泛用于正式与非正式语境。"
    }
  ]
}
