{
  "word": "boston",
  "pronunciation": "baw·stuhn",
  "concise_definition": "n. 波士顿（美国马萨诸塞州城市）",
  "forms": {
    "proper_noun": true
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A major city in the northeastern United States, located in the state of Massachusetts; known for its historical significance in the American Revolution, prestigious universities, and cultural institutions.",
      "explanation_cn": "美国东北部马萨诸塞州的一座主要城市，以在美国独立战争中的历史意义、顶尖大学和文化机构而闻名。",
      "example_en": "Boston is famous for its annual marathon and its role in the American Revolution.",
      "example_cn": "波士顿以其年度马拉松和在美国独立战争中的角色而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A dialect or accent characteristic of the Boston area, marked by non-rhotic pronunciation (dropping the 'r' sound after vowels), such as 'pahk the cah in Hahvahd Yahd'.",
      "explanation_cn": "波士顿地区特有的口音或方言，特征是非卷舌发音（在元音后省略 'r' 音），例如将 'park the car in Harvard Yard' 读作 'pahk the cah in Hahvahd Yahd'。",
      "example_en": "He spoke with a thick Boston accent, making it hard for outsiders to understand him.",
      "example_cn": "他带着浓重的波士顿口音，让外地人很难听懂他的话。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of baked bean dish traditionally associated with Boston, slow-cooked with molasses and salt pork.",
      "explanation_cn": "一种与波士顿传统相关的烤豆菜肴，用糖蜜和咸猪肉慢炖而成。",
      "example_en": "We had Boston baked beans for dinner, sweet and savory with a smoky flavor.",
      "example_cn": "我们晚餐吃了波士顿烤豆，甜中带咸，带有烟熏风味。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "cambridge",
      "analysis": "“Cambridge”（剑桥）是美国马萨诸塞州紧邻波士顿的一座城市，以哈佛大学和麻省理工学院闻名，常与波士顿并提。但“Cambridge”更强调学术与科研氛围，而“Boston”则涵盖更广泛的历史、政治、文化与城市生活。两者地理相邻，但文化定位不同。"
    },
    {
      "word_to_compare": "new york",
      "analysis": "“New York”（纽约）是美国最大的城市和经济中心，以金融、时尚和多元文化著称；而“Boston”规模较小，更注重历史传承、教育和医疗。纽约代表现代都市的喧嚣，波士顿则体现美国殖民传统与学术底蕴的结合。"
    },
    {
      "word_to_compare": "philadelphia",
      "analysis": "“Philadelphia”（费城）同样是美国独立战争的重要城市，与波士顿一样拥有深厚的历史背景。但费城更以《独立宣言》签署地和“自由钟”为象征，而波士顿则以“波士顿倾茶事件”和“自由之路”闻名。两者都是革命圣地，但波士顿的教育与医疗产业更为突出。"
    }
  ]
}