{
  "word": "buckingham",
  "pronunciation": "buhk·ing·uhm",
  "concise_definition": "n. 白金汉（英国地名、王室住所或相关机构名称）",
  "forms": {
    "proper_noun": true
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A royal palace in London, serving as the official residence of the British monarch since 1837, and a major tourist attraction known for the Changing of the Guard ceremony.",
      "explanation_cn": "位于伦敦的一座皇家宫殿，自1837年起成为英国君主的官方住所，以著名的卫兵换岗仪式而闻名，是主要的旅游景点。",
      "example_en": "Tourists gather every morning to watch the Changing of the Guard at Buckingham Palace.",
      "example_cn": "游客每天早晨都会聚集在白金汉宫观看卫兵换岗仪式。"
    },
    {
      "pos": "noun",
      "explanation_en": "A title or surname associated with the British royal family or the historic county of Buckinghamshire, often used in formal contexts such as 'Buckingham Palace' or 'Duke of Buckingham'.",
      "explanation_cn": "与英国王室或白金汉郡历史相关的头衔或姓氏，常用于正式场合，如‘白金汉宫’或‘白金汉公爵’。",
      "example_en": "The Duke of Buckingham was one of the most powerful nobles in 17th-century England.",
      "example_cn": "白金汉公爵是17世纪英格兰最有权势的贵族之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A place name in various countries, such as Buckingham in Quebec, Canada, or Buckingham in Florida, USA, typically derived from the original English location.",
      "explanation_cn": "世界各地以该名称命名的地点，如加拿大魁北克省的白金汉或美国佛罗里达州的白金汉，通常源自英国原址名称。",
      "example_en": "We stopped for coffee in the small town of Buckingham, Florida.",
      "example_cn": "我们在佛罗里达州的一个小镇白金汉停下来喝了杯咖啡。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "palace",
      "analysis": "“Palace”（宫殿）是一个通用名词，泛指任何王室或贵族居住的宏伟建筑，而 “Buckingham” 是一个专有名词，特指位于伦敦的那座著名皇家宫殿。前者是类别，后者是具体实例。"
    },
    {
      "word_to_compare": "Westminster",
      "analysis": "“Westminster”（威斯敏斯特）是伦敦另一个重要的政治与宗教中心，以威斯敏斯特宫（议会大厦）和威斯敏斯特大教堂闻名，而 “Buckingham” 则是王室的居住与象征中心。两者同为伦敦地标，但功能不同：前者是政府权力中心，后者是王室生活与仪式中心。"
    },
    {
      "word_to_compare": "Windsor",
      "analysis": "“Windsor”（温莎）是英国王室的另一处主要居所，温莎城堡是世界上最大的有人居住的城堡，常用于周末或节假日居住；而 “Buckingham” 是官方正式住所，用于国家典礼和日常政务。两者均为王室住所，但用途和象征意义不同。"
    }
  ]
}