{
  "word": "carnegie",
  "pronunciation": "kahr·nuh·gee",
  "concise_definition": "n. 卡内基（姓氏），常指安德鲁·卡内基；adj. 卡内基的",
  "forms": {
    "proper_noun": true
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Andrew Carnegie (1835–1919), a Scottish-American industrialist and philanthropist who became one of the richest men in history through the steel industry and later donated vast sums to education, libraries, and peace initiatives.",
      "explanation_cn": "专有名词，指安德鲁·卡内基（1835–1919），苏格兰裔美国实业家与慈善家，通过钢铁工业成为历史上最富有的人之一，后将巨额财富捐赠给教育、图书馆和和平事业。",
      "example_en": "The Carnegie Library in Pittsburgh was funded by Andrew Carnegie’s philanthropy.",
      "example_cn": "匹兹堡的卡内基图书馆是由安德鲁·卡内基的慈善捐赠资助建立的。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun used in the names of institutions, foundations, or awards established by or named in honor of Andrew Carnegie, such as Carnegie Mellon University or the Carnegie Endowment for International Peace.",
      "explanation_cn": "用于以安德鲁·卡内基命名或由其创立的机构、基金会或奖项的名称中，例如卡内基梅隆大学或卡内基国际和平基金会。",
      "example_en": "She received the Carnegie Medal for her outstanding contribution to children’s literature.",
      "example_cn": "她因在儿童文学领域的杰出贡献而荣获卡内基奖章。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or associated with Andrew Carnegie or the institutions he founded.",
      "explanation_cn": "与安德鲁·卡内基或其创立的机构相关的。",
      "example_en": "The Carnegie Hall concert featured world-renowned orchestras.",
      "example_cn": "卡内基音乐厅的音乐会汇聚了世界知名的乐团。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "rockefeller",
      "analysis": "“Rockefeller”（洛克菲勒）是另一位美国工业巨头与慈善家约翰·D·洛克菲勒的姓氏，主要通过石油工业积累财富，其慈善事业侧重于医学、教育和公共卫生。与“Carnegie”类似，两者都是19世纪末20世纪初美国‘镀金时代’的代表性慈善家，但卡内基更强调公共图书馆和教育普及，而洛克菲勒更注重系统性科研资助。"
    },
    {
      "word_to_compare": "ford",
      "analysis": "“Ford”（福特）通常指汽车大亨亨利·福特，其影响力主要来自大规模生产模式和工人高薪政策，而非大规模慈善捐赠。与“Carnegie”不同，福特虽有社会影响力，但其慈善行为未形成系统性基金会网络，且公众对其态度更为复杂。"
    },
    {
      "word_to_compare": "vanderbilt",
      "analysis": "“Vanderbilt”（范德比尔特）是另一著名美国富豪家族姓氏，财富源于铁路与航运，其慈善捐赠多用于大学（如范德比尔特大学）和医疗设施。与“Carnegie”相比，范德比尔特家族的慈善更集中于家族命名的机构，而卡内基的捐赠更强调公共性与普世价值，如免费图书馆面向所有阶层开放。"
    }
  ]
}