{
  "word": "columbia",
  "pronunciation": "koh·lum·bee·uh",
  "concise_definition": "n. 哥伦比亚（国家/地区/大学等）",
  "forms": {
    "plural": "Columbias"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The Republic of Colombia, a country in northwestern South America, known for its diverse ecosystems, rich cultural heritage, and major exports such as coffee and emeralds.",
      "explanation_cn": "位于南美洲西北部的国家，全称为哥伦比亚共和国，以其多样的生态系统、丰富的文化遗产以及咖啡和祖母绿等主要出口产品而闻名。",
      "example_en": "Colombia is famous for its high-quality Arabica coffee beans.",
      "example_cn": "哥伦比亚以其高品质的阿拉比卡咖啡豆而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "The District of Columbia, the federal capital district of the United States, which contains the city of Washington, D.C., and is not part of any U.S. state.",
      "explanation_cn": "美国的联邦首都区，包含华盛顿特市，不属于任何一个美国州。",
      "example_en": "The White House is located in Washington, D.C., within the District of Columbia.",
      "example_cn": "白宫位于华盛顿特区，属于哥伦比亚特区。"
    },
    {
      "pos": "noun",
      "explanation_en": "Columbia University, a prestigious private Ivy League research university located in New York City, founded in 1754.",
      "explanation_cn": "位于纽约市的一所著名私立常春藤盟校级研究型大学，成立于1754年。",
      "example_en": "She earned her Ph.D. in literature from Columbia University.",
      "example_cn": "她从哥伦比亚大学获得了文学博士学位。"
    },
    {
      "pos": "noun",
      "explanation_en": "A poetic or symbolic name for the United States of America, derived from Christopher Columbus, often used in historical, literary, or patriotic contexts.",
      "explanation_cn": "源自克里斯托弗·哥伦布的美国诗意或象征性名称，常用于历史、文学或爱国语境中。",
      "example_en": "The statue of Columbia stands as a symbol of liberty and democracy.",
      "example_cn": "哥伦比亚女神雕像象征着自由与民主。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "America",
      "analysis": "“America” 通常泛指美洲大陆或美国，语义更宽泛；而 “Columbia” 作为美国的象征性名称，更具文学性和历史感，多用于正式或诗意表达，日常使用频率远低于 “America”。"
    },
    {
      "word_to_compare": "Washington",
      "analysis": "“Washington” 可指美国首都华盛顿特区或总统华盛顿，是具体地理或人物名称；而 “Columbia” 是抽象的国家象征，常以拟人化形象（如女神）出现，代表国家精神而非实体地点。"
    },
    {
      "word_to_compare": "Hispaniola",
      "analysis": "“Hispaniola” 是加勒比海的一个岛屿，分属海地和多米尼加共和国，是地理实体；而 “Columbia” 作为国家名或象征名，具有政治、文化与历史多重含义，不局限于地理边界。"
    }
  ]
}