{
  "word": "complementary",
  "pronunciation": "kahm·pluh·men·ter·ee",
  "concise_definition": "adj. 补充的, 补足的, 互补的",
  "forms": {
    "adverb": "complementarily",
    "noun": "complementarity",
    "comparison": {
      "comparative": "more complementary",
      "superlative": "most complementary"
    }
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Serving to complete or enhance something else by providing what is lacking or by forming a pleasing combination; often used to describe things that work well together because they contrast or balance each other.",
      "explanation_cn": "通过提供缺失的部分或形成和谐搭配来补充或增强其他事物；常用于描述因相互对比或平衡而能完美配合的事物。",
      "example_en": "The blue and yellow colors are complementary and create a vibrant visual effect.",
      "example_cn": "蓝色和黄色是互补色，能产生鲜明的视觉效果。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In mathematics or logic, referring to two angles or sets that together form a whole, such as two angles that add up to 90 degrees or two sets whose union equals the universal set.",
      "explanation_cn": "在数学或逻辑中，指两个角度或集合加起来构成一个整体，例如两个角度之和为90度，或两个集合的并集等于全集。",
      "example_en": "Angle A and angle B are complementary because they sum to 90 degrees.",
      "example_cn": "角A和角B是互余角，因为它们的和为90度。"
    },
    {
      "pos": "adjective",
      "explanation_en": "In biology or economics, describing two entities that mutually support or benefit each other’s function or existence, often in a symbiotic or cooperative relationship.",
      "explanation_cn": "在生物学或经济学中，指两个实体在功能或存在上相互支持或受益，常表现为共生或合作关系。",
      "example_en": "The complementary roles of the CEO and the CFO ensure the company’s strategic and financial health.",
      "example_cn": "首席执行官与首席财务官的互补角色确保了公司的战略与财务健康。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "complimentary",
      "analysis": "“Complimentary”（免费的/称赞的）与 “complementary” 发音相似但意义完全不同。前者指免费提供的（如 complimentary drink）或表达赞美的（complimentary remarks），后者则强调“补充”或“互补”的功能关系。两者极易混淆，需注意语境区分。"
    },
    {
      "word_to_compare": "supplementary",
      "analysis": "“Supplementary”（补充的）指在原有基础上额外添加的内容，通常不是必需的，而是辅助性的。而 “complementary” 强调两者缺一不可，共同构成完整整体。例如，补充教材（supplementary material）可选，但互补技能（complementary skills）是协作中不可或缺的。"
    },
    {
      "word_to_compare": "compatible",
      "analysis": "“Compatible”（兼容的）强调两者能和平共处、不冲突，但不一定相互增强。而 “complementary” 不仅不冲突，还彼此补充、互相提升。例如，两个软件可能兼容（compatible），但只有当它们的功能能互相弥补时，才是互补的（complementary）。"
    }
  ]
}