{
  "word": "damascus",
  "pronunciation": "dæm·əs·kəs",
  "concise_definition": "n. 大马士革（叙利亚首都）；大马士革钢；大马士革花纹",
  "forms": {
    "adjective": "Damascene"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The capital city of Syria, historically significant as a major cultural, commercial, and religious center since ancient times, known for its well-preserved medieval architecture and vibrant markets.",
      "explanation_cn": "叙利亚的首都，自古以来就是重要的文化、商业和宗教中心，以其保存完好的中世纪建筑和热闹的市场而闻名。",
      "example_en": "Damascus has been continuously inhabited for over 11,000 years, making it one of the oldest cities in the world.",
      "example_cn": "大马士革已持续有人居住超过一万一千年的历史，是世界上最古老的城市之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A type of high-quality steel originally made in Damascus, characterized by its distinctive wavy or watered patterns and exceptional hardness and sharpness, traditionally used for swords and knives.",
      "explanation_cn": "一种原产于大马士革的优质钢材，以其独特的波浪状或水纹状花纹、极高的硬度和锋利度著称，传统上用于制造刀剑。",
      "example_en": "The antique dagger was forged from authentic Damascus steel, its surface shimmering with intricate patterns.",
      "example_cn": "这把古董短刀由正宗的大马士革钢锻造而成，表面闪烁着精美的花纹。"
    },
    {
      "pos": "noun",
      "explanation_en": "A decorative pattern resembling the natural grain of Damascus steel, often replicated on fabrics, paper, or metal surfaces for aesthetic purposes.",
      "explanation_cn": "一种模仿大马士革钢天然纹理的装饰性图案，常用于织物、纸张或金属表面，以增强视觉美感。",
      "example_en": "The book’s cover featured a damascus pattern in gold foil, evoking the elegance of ancient weaponry.",
      "example_cn": "这本书的封面采用金色箔片印制的大马士革花纹，唤起了古代武器的优雅感。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "steel",
      "analysis": "“Steel”（钢）是一个泛指的金属材料类别，而 “Damascus” 特指具有独特花纹和历史工艺的特定类型钢材。并非所有钢都是大马士革钢，但所有大马士革钢都是钢的一种。前者强调成分与性能，后者强调工艺、纹理与文化传承。"
    },
    {
      "word_to_compare": "pattern",
      "analysis": "“Pattern”（图案）是通用术语，指任何重复的装饰设计，而 “Damascus” 作为名词特指源自大马士革钢的水纹状独特纹理。它不仅是图案，更承载着冶金技艺与历史象征，具有专有名词的属性。"
    },
    {
      "word_to_compare": "city",
      "analysis": "“City”（城市）是泛指人类聚居地，而 “Damascus” 是一个具体地名，承载着千年文明史。它不仅是地理实体，也是文化符号，常在文学、艺术和历史语境中被赋予象征意义，如“东方明珠”或“古老智慧的化身”。"
    }
  ]
}