{
  "word": "docking",
  "pronunciation": "dok·ing",
  "concise_definition": "n. 靠泊, 对接, 停靠; v. 扣减, 停靠",
  "forms": {
    "noun": "docking",
    "verb_third_person_singular": "docks",
    "verb_past_tense": "docked",
    "verb_past_participle": "docked",
    "verb_present_participle": "docking"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The act of connecting a spacecraft, vehicle, or vessel to another structure, typically for the purpose of transferring personnel, cargo, or resources.",
      "explanation_cn": "指航天器、车辆或船只与另一结构连接的行为，通常用于人员、货物或资源的转移。",
      "example_en": "The successful docking of the spacecraft with the space station marked a major milestone in the mission.",
      "example_cn": "航天器与空间站的成功对接标志着此次任务的重大里程碑。"
    },
    {
      "pos": "noun",
      "explanation_en": "A structure or facility designed for mooring or berthing ships, boats, or spacecraft, often equipped with utilities and access points.",
      "explanation_cn": "指专为停泊船舶、船只或航天器而设计的设施或结构，通常配备有 utilities 和进出通道。",
      "example_en": "The new marina includes a state-of-the-art docking system for yachts and fishing boats.",
      "example_cn": "新的游艇码头配备了先进的游艇和渔船停泊系统。"
    },
    {
      "pos": "verb",
      "explanation_en": "To connect or attach a vehicle, especially a spacecraft or ship, to another structure or platform.",
      "explanation_cn": "指将车辆（尤其是航天器或船舶）连接到另一结构或平台上。",
      "example_en": "The astronauts docked the capsule to the International Space Station after a six-hour flight.",
      "example_cn": "宇航员在六小时飞行后将飞船对接到了国际空间站。"
    },
    {
      "pos": "verb",
      "explanation_en": "To reduce or subtract a portion of something, especially wages or privileges, as a penalty or adjustment.",
      "explanation_cn": "指作为惩罚或调整，扣减某物的一部分，尤指工资或特权。",
      "example_en": "The company docked his pay for arriving late three times in one week.",
      "example_cn": "该公司因他一周内三次迟到而扣除了他的工资。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "berthing",
      "analysis": "“Berthing” (停泊) 通常指船舶在码头或泊位上的安全停靠，强调位置的固定和物理安置，多用于航海语境。而 “docking” 更强调与另一结构的主动连接，尤其在航天或技术语境中，包含对接、锁定等技术动作。"
    },
    {
      "word_to_compare": "linking",
      "analysis": "“Linking” (连接) 是一个更通用的词，泛指任何形式的连接，可以是物理的、逻辑的或抽象的（如数据链接）。而 “docking” 专指具有特定接口、机械或系统兼容性的物理对接，通常涉及标准化的连接机制，如航天器对接环或电脑外设插槽。"
    },
    {
      "word_to_compare": "deduct",
      "analysis": "“Deduct” (扣除) 是一个更正式、更广泛的财务术语，用于从总额中减去金额，常用于税务、账目等场景。而 “dock” 作为动词时，特指因违规或过失而进行的惩罚性扣减，语气更口语化，且常用于工资、福利等情境，带有主观裁量的意味。"
    }
  ]
}