{
  "word": "fc",
  "pronunciation": "ef si",
  "concise_definition": "abbr. 足球俱乐部, 文件控制, 流量控制",
  "forms": {
    "plural": "fcs"
  },
  "definitions": [
    {
      "pos": "abbreviation",
      "explanation_en": "Stands for 'Football Club', commonly used in the names of professional or amateur soccer teams, especially in Europe and other regions where soccer is popular.",
      "explanation_cn": "是 'Football Club' 的缩写，常用于欧洲及其他足球流行地区的职业或业余足球俱乐部名称中。",
      "example_en": "Liverpool FC is one of the most successful football clubs in English history.",
      "example_cn": "利物浦足球俱乐部是英格兰历史上最成功的足球俱乐部之一。"
    },
    {
      "pos": "abbreviation",
      "explanation_en": "Stands for 'File Control', referring to the management and organization of files in computing systems, including permissions, storage, and access protocols.",
      "explanation_cn": "是 'File Control' 的缩写，指在计算机系统中对文件进行管理与组织，包括权限设置、存储方式和访问协议。",
      "example_en": "The system requires proper FC settings to prevent unauthorized file access.",
      "example_cn": "为防止未经授权的文件访问，系统需要正确的文件控制设置。"
    },
    {
      "pos": "abbreviation",
      "explanation_en": "Stands for 'Flow Control', a mechanism in data communication that regulates the rate of data transmission between sender and receiver to prevent overflow or loss.",
      "explanation_cn": "是 'Flow Control' 的缩写，指在数据通信中调节发送方与接收方之间数据传输速率的机制，以防止数据溢出或丢失。",
      "example_en": "TCP uses flow control to ensure reliable data delivery over networks.",
      "example_cn": "TCP 协议使用流量控制来确保网络上的可靠数据传输。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "club",
      "analysis": "“Club”（俱乐部）是一个通用词，可指任何类型的社团或组织，如读书俱乐部、健身俱乐部。而 “FC” 是特指足球俱乐部的缩写，具有明确的体育领域指向性，不能泛用于其他类型组织。"
    },
    {
      "word_to_compare": "ctrl",
      "analysis": "“Ctrl” 是 “Control” 的缩写，常用于计算机键盘快捷键（如 Ctrl+C），泛指控制功能。而 “FC” 作为 “Flow Control” 或 “File Control” 的缩写时，特指数据或文件管理中的具体技术机制，语义范围更窄、更专业。"
    },
    {
      "word_to_compare": "soccer",
      "analysis": "“Soccer” 是美式英语中对 “football” 的称呼，指运动项目本身。而 “FC” 是组织名称的组成部分，代表从事该运动的机构实体。二者属于不同层级：一个是运动，一个是组织。"
    }
  ]
}