{
  "word": "input",
  "pronunciation": "in·put",
  "concise_definition": "n. 输入, 投入; v. 输入, 输入数据",
  "forms": {
    "plural": "inputs",
    "third_person_singular": "inputs",
    "past_tense": "input",
    "past_participle": "input",
    "present_participle": "inputting"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Data, information, or material that is entered into a system, machine, or process for processing, analysis, or response.",
      "explanation_cn": "指输入到系统、机器或流程中以供处理、分析或响应的数据、信息或材料。",
      "example_en": "The computer requires user input to execute the command.",
      "example_cn": "计算机需要用户输入才能执行该命令。"
    },
    {
      "pos": "noun",
      "explanation_en": "A contribution or participation, especially in a discussion, project, or decision-making process.",
      "explanation_cn": "指在讨论、项目或决策过程中所作出的贡献或参与。",
      "example_en": "Your input on the design is greatly appreciated.",
      "example_cn": "我们非常感谢您对设计提出的建议。"
    },
    {
      "pos": "verb",
      "explanation_en": "To enter data or information into a computer system or device.",
      "explanation_cn": "指将数据或信息输入到计算机系统或设备中。",
      "example_en": "Please input your password to log in.",
      "example_cn": "请输入您的密码以登录。"
    },
    {
      "pos": "verb",
      "explanation_en": "To introduce resources, effort, or ideas into a system or process to achieve a result.",
      "explanation_cn": "指将资源、努力或想法引入某个系统或流程以达成某种结果。",
      "example_en": "The government has invested heavily in education, but the quality of input from teachers remains inconsistent.",
      "example_cn": "政府在教育上投入了大量资金，但教师的投入质量仍不一致。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "entry",
      "analysis": "“Entry” (条目/录入) 通常指单个数据项或记录的插入，常用于数据库、表格或名单中，强调形式上的“登记”或“记录”。而 “input” 更广泛，可指任何形式的输入行为或内容，包括非结构化的信息或资源投入。"
    },
    {
      "word_to_compare": "contribution",
      "analysis": "“Contribution” (贡献) 更侧重于抽象层面的参与或付出，如时间、想法、资金等，常用于人际或组织语境中，语气更正式、更强调价值。而 “input” 在口语中更常用，既可以指具体的数据输入，也可指抽象意见，语义范围更广。"
    },
    {
      "word_to_compare": "feed",
      "analysis": "“Feed” (输入/供给) 常用于比喻性语境，如“feed data into a system”，强调持续性、动态性的供给过程，常带有自动化或机械化的意味。而 “input” 更中性，可指一次性或非连续性的输入行为，适用范围更广，包括人工操作。"
    }
  ]
}