{
  "word": "jewish",
  "pronunciation": "joo·uh·wih",
  "concise_definition": "adj. 犹太人的, 犹太教的; n. 犹太人",
  "forms": {
    "plural_noun": "Jews"
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to the Jewish people, their culture, religion, or history; specifically connected to Judaism, the monotheistic religion originating from the ancient Israelites.",
      "explanation_cn": "与犹太民族、其文化、宗教或历史相关的；特指源于古代以色列人的单一神教——犹太教。",
      "example_en": "She comes from a Jewish family that observes Passover every year.",
      "example_cn": "她来自一个每年都会庆祝逾越节的犹太家庭。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Describing practices, traditions, language, or customs associated with Jewish communities around the world, including Yiddish, kosher dietary laws, and religious holidays.",
      "explanation_cn": "描述与世界各地犹太社群相关的实践、传统、语言或习俗，包括意第绪语、洁食饮食法规和宗教节日。",
      "example_en": "The museum features an exhibit on Jewish art and literature from medieval Europe.",
      "example_cn": "该博物馆展出了中世纪欧洲犹太艺术与文学的专题内容。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is a member of the Jewish ethnic and/or religious group, typically descended from the ancient Israelites and adhering to Judaism or identifying culturally with Jewish heritage.",
      "explanation_cn": "指属于犹太民族和/或宗教群体的人，通常为古代以色列人的后裔，信奉犹太教或在文化上认同犹太传统。",
      "example_en": "Many Jewish communities have thrived in New York City for over a century.",
      "example_cn": "许多犹太社群在纽约市已繁荣发展了一个多世纪。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Hebrew",
      "analysis": "“Hebrew”（希伯来语的/希伯来人的）主要指语言（希伯来语）或古代民族（希伯来人），是犹太民族在圣经时代使用的语言和身份称谓。而 “Jewish” 是现代更广泛使用的术语，涵盖宗教、文化、民族认同，不限于语言。现代以色列人说希伯来语，但并非所有希伯来语使用者都是犹太人。"
    },
    {
      "word_to_compare": "Israelite",
      "analysis": "“Israelite”（以色列人）特指古代《圣经》时代十二支派的后裔，是历史术语，多用于宗教或考古语境。而 “Jewish” 是延续至今的现代身份认同，包含宗教信仰、文化习俗和民族归属，范围更广。所有以色列人都是犹太人的祖先，但并非所有犹太人都自称为以色列人。"
    },
    {
      "word_to_compare": "Sephardic",
      "analysis": "“Sephardic”（塞法迪犹太人的）是犹太人群体中的一个分支，特指祖先来自伊比利亚半岛（西班牙、葡萄牙）的犹太人及其后裔，拥有独特的宗教仪式和语言（拉迪诺语）。而 “Jewish” 是总称，包含阿什肯纳兹、塞法迪、米兹拉希等多个子群体。因此，所有塞法迪犹太人都是犹太人，但并非所有犹太人都是塞法迪人。"
    }
  ]
}
