{
  "word": "klein",
  "pronunciation": "klyne",
  "concise_definition": "adj. 克莱因的（专用于人名或数学/物理术语）",
  "forms": {
    "no_inflections": true
  },
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to Felix Klein, a German mathematician known for his contributions to group theory, geometry, and the Erlangen Program, which unified various geometries through the concept of symmetry groups.",
      "explanation_cn": "与德国数学家菲利克斯·克莱因相关的，他以在群论、几何学和埃尔朗根纲领方面的贡献而闻名，该纲领通过对称群的概念统一了各种几何体系。",
      "example_en": "The Klein bottle is a non-orientable surface with no distinct inside or outside.",
      "example_cn": "克莱因瓶是一种不可定向的曲面，没有明确的内外之分。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Used in mathematical and physical contexts to describe structures, spaces, or models named after Felix Klein, such as Klein four-group, Klein geometry, or Klein-Gordon equation.",
      "explanation_cn": "在数学和物理语境中，用于描述以菲利克斯·克莱因命名的结构、空间或模型，例如克莱因四元群、克莱因几何或克莱因-戈登方程。",
      "example_en": "The Klein-Gordon equation is a relativistic wave equation used in quantum field theory.",
      "example_cn": "克莱因-戈登方程是量子场论中使用的一个相对论性波动方程。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Felix Klein (1849–1925), the influential German mathematician and educator who promoted the integration of advanced mathematics into secondary education.",
      "explanation_cn": "专有名词，指德国著名数学家与教育家菲利克斯·克莱因（1849–1925），他推动了高等数学在中学教育中的融合。",
      "example_en": "Klein's vision of mathematics education continues to influence curricula worldwide.",
      "example_cn": "克莱因的数学教育理念至今仍影响着全球的课程设置。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Riemann",
      "analysis": "“Riemann”（黎曼）同样作为人名用于数学术语（如黎曼几何、黎曼积分），但黎曼的工作更侧重于分析、复变函数与曲面的度量性质，而克莱因的贡献集中在几何的分类与群论的统一视角。两者都奠定了现代几何的基础，但路径不同：黎曼关注内在度量，克莱因关注对称性与变换群。"
    },
    {
      "word_to_compare": "Euclidean",
      "analysis": "“Euclidean”（欧几里得的）描述的是基于欧几里得公理的传统几何体系，强调平行公设和固定距离。而 “Klein” 所指的几何是更广义的，通过变换群定义几何对象，欧几里得几何只是克莱因几何中的一个特例。因此，Klein 提供的是一个更抽象、更包容的框架。"
    },
    {
      "word_to_compare": "Poincaré",
      "analysis": "“Poincaré”（庞加莱）也是一位与克莱因同时代的数学家，其工作涉及拓扑学与动力系统。虽然两者都研究几何与群，但庞加莱更关注连续性与不变量，而克莱因强调通过群作用来定义几何结构。庞加莱猜想是拓扑学的里程碑，而克莱因纲领是几何学的分类蓝图。"
    }
  ]
}