{
  "word": "lafayette",
  "pronunciation": "la·fay·et",
  "concise_definition": "n. 拉法耶特（人名/地名）",
  "forms": {
    "plural": "Lafayettes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A proper noun referring to Gilbert du Motier, Marquis de Lafayette (1757–1834), a French aristocrat and military officer who played a key role in the American Revolutionary War as a close ally of George Washington.",
      "explanation_cn": "专有名词，指吉尔伯特·杜·莫蒂埃，拉法耶特侯爵（1757–1834），一位法国贵族和军事将领，在美国独立战争中作为乔治·华盛顿的亲密盟友发挥了关键作用。",
      "example_en": "Lafayette's leadership and dedication helped secure French support for the American cause.",
      "example_cn": "拉法耶特的领导与奉献帮助美国争取到了法国的支持。"
    },
    {
      "pos": "noun",
      "explanation_en": "A proper noun used to name numerous places, streets, monuments, and institutions in the United States and other countries, honoring the legacy of the Marquis de Lafayette.",
      "explanation_cn": "专有名词，用于命名美国及其他国家的众多地点、街道、纪念碑和机构，以纪念拉法耶特侯爵的功绩。",
      "example_en": "We visited Lafayette Park near the White House, named in his honor.",
      "example_cn": "我们参观了位于白宫附近的拉法耶特公园，该公园以他的名字命名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname or given name used by individuals in honor of the historical figure, particularly in French-speaking or American contexts.",
      "explanation_cn": "作为姓氏或名字使用，以向这位历史人物致敬，尤其在法语区或美国语境中。",
      "example_en": "Many American families bear the surname Lafayette as a tribute to the hero of two revolutions.",
      "example_cn": "许多美国家庭以“拉法耶特”为姓氏，以纪念这位两次革命的英雄。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "Washington",
      "analysis": "“Washington”（华盛顿）通常指美国国父乔治·华盛顿，是美国独立与建国的核心人物；而 “Lafayette” 是一位外国盟友，虽非美国本土出身，却以无私奉献赢得美国人民的尊敬。两者常并列出现，但华盛顿是国家象征，拉法耶特是国际友谊的象征。"
    },
    {
      "word_to_compare": "hero",
      "analysis": "“Hero”（英雄）是泛指具有英勇行为或崇高品德的人；而 “Lafayette” 是一个具体的历史人物，其“英雄”身份源于特定的历史贡献。前者是抽象概念，后者是具体指称，不可互换。"
    },
    {
      "word_to_compare": "monument",
      "analysis": "“Monument”（纪念碑）是纪念某人或某事的物理建筑；而 “Lafayette” 本身是被纪念的对象。许多纪念碑以他命名，但“Lafayette”不是纪念碑，而是名字。二者是“被纪念者”与“纪念物”的关系。"
    }
  ]
}