{
  "word": "leap",
  "pronunciation": "lehp",
  "concise_definition": "v. 跳跃, 纵身一跃; n. 跳跃, 突然的进展",
  "forms": {
    "third_person_singular": "leaps",
    "past_tense": "leapt",
    "past_participle": "leapt",
    "present_participle": "leaping"
  },
  "definitions": [
    {
      "pos": "verb",
      "explanation_en": "To push oneself off the ground and into the air with force, typically using the legs, often to move quickly or avoid something.",
      "explanation_cn": "指用腿部用力将身体推离地面，跃入空中，通常是为了快速移动或躲避某物。",
      "example_en": "The cat leapt over the fence to chase the bird.",
      "example_cn": "那只猫跃过篱笆去追鸟。"
    },
    {
      "pos": "verb",
      "explanation_en": "To move suddenly or dramatically from one state, condition, or position to another, often without gradual steps.",
      "explanation_cn": "指突然或显著地从一种状态、条件或位置转变为另一种，通常不经过渐进过程。",
      "example_en": "The company leapt from a small startup to a global leader in just five years.",
      "example_cn": "这家公司仅用五年时间就从一家初创企业跃升为全球领导者。"
    },
    {
      "pos": "noun",
      "explanation_en": "A sudden, forceful jump or movement through the air, often covering a significant distance.",
      "explanation_cn": "指一次突然而有力的跳跃或在空中的移动，通常跨越较远距离。",
      "example_en": "He made a daring leap across the narrow gap between the two buildings.",
      "example_cn": "他大胆地跃过两栋建筑之间的狭窄缝隙。"
    },
    {
      "pos": "noun",
      "explanation_en": "A significant and sudden advance or increase in quality, quantity, or status.",
      "explanation_cn": "指在质量、数量或地位上的显著而突然的提升或进步。",
      "example_en": "The invention of the internet marked a great leap in human communication.",
      "example_cn": "互联网的发明标志着人类沟通方式的巨大飞跃。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "jump",
      "analysis": "“Jump” (跳跃) 是更通用的词，泛指任何从地面腾起的动作，可以是小幅度的、日常的，如跳过水坑。而 “leap” 更强调力量、距离和戏剧性，常用于描述更宏大、更勇敢或更显著的跳跃，语义上更具动感和冲击力。"
    },
    {
      "word_to_compare": "bound",
      "analysis": "“Bound” (跳跃/弹跳) 常带有轻盈、有弹性的意味，多用于动物或连续的跳跃动作，如兔子蹦跳。“Leap” 则更强调单次的、目标明确的强力跃动，常用于人类或抽象意义上的重大跨越。"
    },
    {
      "word_to_compare": "plunge",
      "analysis": "“Plunge” (猛冲/投入) 指快速向下或向内的动作，常带有危险或冲动的意味，如跳入水中或投入投资。而 “leap” 可以是向上、向前或横向的，不一定有负面含义，且更常用于积极的飞跃或进步语境中。"
    }
  ]
}