{
  "word": "london",
  "pronunciation": "lun·duhn",
  "concise_definition": "n. 伦敦（英国首都）",
  "forms": {
    "plural": "Londons"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The capital city of England and the United Kingdom, located on the River Thames; a major global center for politics, finance, culture, and education.",
      "explanation_cn": "英格兰和英国的首都，位于泰晤士河畔；全球政治、金融、文化和教育的重要中心。",
      "example_en": "London is famous for its historic landmarks, such as the Tower of London and Buckingham Palace.",
      "example_cn": "伦敦以其历史地标而闻名，如伦敦塔和白金汉宫。"
    },
    {
      "pos": "noun",
      "explanation_en": "A metropolitan area encompassing Greater London, including 32 boroughs and the City of London, with a diverse population and extensive public transportation network.",
      "explanation_cn": "指包括大伦敦地区在内的都市区域，涵盖32个自治市和伦敦金融城，拥有多元人口和发达的公共交通系统。",
      "example_en": "Over eight million people live in Greater London, making it one of the most populous cities in Europe.",
      "example_cn": "大伦敦地区居住着超过八百万人，使其成为欧洲人口最多的城市之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A symbolic representation of British identity, history, and global influence, often used in media and literature to evoke tradition, modernity, or cosmopolitanism.",
      "explanation_cn": "作为英国身份、历史与全球影响力的象征，常在媒体和文学作品中用来唤起传统、现代性或国际化的意象。",
      "example_en": "In novels, London often serves as a character in its own right — mysterious, bustling, and full of secrets.",
      "example_cn": "在小说中，伦敦常常本身就像一个角色——神秘、喧嚣且充满秘密。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "city",
      "analysis": "“City”（城市）是一个通用词，泛指任何人口密集、具有行政或经济功能的聚居地。而 “London” 是一个专有名词，特指英国的首都，承载着独特的历史、政治和文化内涵，不能与其他城市互换使用。"
    },
    {
      "word_to_compare": "metropolis",
      "analysis": "“Metropolis”（大都市）强调规模庞大、经济文化高度集中的城市，常用于学术或文学语境。虽然伦敦是一个典型的 metropolis，但该词是泛称，不特指某地；而 “London” 是具体地名，具有唯一性和排他性。"
    },
    {
      "word_to_compare": "capital",
      "analysis": "“Capital”（首都）指一个国家的政治中心，可能指城市本身，也可能指其功能。伦敦是英国的 capital，但并非所有 capital 都是伦敦。例如，巴黎是法国的 capital，但不是 London。两者是类别与实例的关系。"
    }
  ]
}