{
  "word": "northeast",
  "pronunciation": "nohrth·est",
  "concise_definition": "n. 东北, 东北方向; adj. 东北的",
  "forms": {
    "plural": "northeasts"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "The direction or region that is between north and east, typically referring to one of the four cardinal intermediate directions on a compass.",
      "explanation_cn": "指位于正北与正东之间的方向，通常指罗盘上的四个中间方位之一，即东北方向。",
      "example_en": "The storm is moving toward the northeast at 20 miles per hour.",
      "example_cn": "风暴正以每小时20英里的速度向东北方向移动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A geographic region in the northeastern part of a country, especially used to refer to the northeastern United States, including states like Maine, New Hampshire, Vermont, Massachusetts, Rhode Island, Connecticut, New York, New Jersey, and Pennsylvania.",
      "explanation_cn": "指一个国家东北部的地理区域，尤指美国东北部，包括缅因州、新罕布什尔州、佛蒙特州、马萨诸塞州、罗德岛州、康涅狄格州、纽约州、新泽西州和宾夕法尼亚州等。",
      "example_en": "She moved from the northeast to California for a new job.",
      "example_cn": "她从东北部搬到加利福尼亚州寻找新工作。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or located in the northeast direction or region.",
      "explanation_cn": "与东北方向或东北地区相关的，或位于该区域的。",
      "example_en": "The northeast coast of the island is known for its rugged cliffs and scenic views.",
      "example_cn": "岛屿的东北海岸以其崎岖的悬崖和壮丽的景色而闻名。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "northwest",
      "analysis": "“Northwest”（西北）是与“northeast”相对的方位词，位于正北与正西之间。两者都是复合方位词，但所指区域相反。在地理描述中，它们常用于区分不同区域的气候、文化或经济特征，如美国的“Northeast”与“Northwest”在人口密度和产业类型上存在显著差异。"
    },
    {
      "word_to_compare": "eastern",
      "analysis": "“Eastern”（东部的）是一个更宽泛的方位形容词，泛指任何位于东侧的区域，不特指东北方向。而 “northeast” 是精确的复合方位词，强调北与东之间的特定角度。例如，“eastern states” 可能包括佛罗里达州，但 “northeastern states” 则仅限于美国东北部的几个州。"
    },
    {
      "word_to_compare": "northern",
      "analysis": "“Northern”（北部的）仅表示位于北方的区域，不包含东方的成分。而 “northeast” 是一个方向性更强、更精确的术语，结合了北和东两个维度。例如，加拿大北部（northern Canada）包括北极地区，而“northeastern Canada”则特指新不伦瑞克、新斯科舍等大西洋省份。"
    }
  ]
}
