{
  "word": "picasso",
  "pronunciation": "pee·kah·soh",
  "concise_definition": "n. 毕加索（西班牙著名画家），引申为天才艺术家或前卫艺术的代名词",
  "forms": {
    "plural": "Picassos"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "Pablo Picasso (1881–1973), a Spanish painter, sculptor, and printmaker, widely regarded as one of the most influential artists of the 20th century, co-founder of Cubism, and a prolific creator whose work spans multiple styles and periods.",
      "explanation_cn": "巴勃罗·毕加索（1881–1973），西班牙画家、雕塑家和版画家，被广泛认为是20世纪最具影响力的艺术家之一，立体主义的创始人之一，其作品风格多样、产量极高，涵盖多个艺术时期。",
      "example_en": "The museum's latest exhibition features over 200 works by Picasso, showcasing his evolution from realism to abstract expression.",
      "example_cn": "博物馆最新展览展出了毕加索的200多件作品，展现了他从写实主义到抽象表现主义的演变历程。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person who is exceptionally creative or innovative in art, design, or any field, often used metaphorically to describe someone with genius-level originality.",
      "explanation_cn": "指在艺术、设计或任何领域中具有非凡创造力或创新精神的人，常被隐喻性地用来形容具有天才级原创力的人。",
      "example_en": "She’s a Picasso of marketing—turning simple ideas into viral campaigns with stunning visuals.",
      "example_cn": "她是个营销界的毕加索——能把简单的想法用惊艳的视觉转化为病毒式传播的活动。"
    },
    {
      "pos": "noun",
      "explanation_en": "A style or work characterized by bold, fragmented forms, distorted perspectives, and emotional intensity, reflecting the aesthetic principles of Cubism pioneered by Picasso.",
      "explanation_cn": "指一种以大胆、碎片化形态、扭曲透视和强烈情感为特征的艺术风格或作品，反映了毕加索开创的立体主义美学原则。",
      "example_en": "The building’s facade has a Picasso-like quality, with angular shapes and clashing colors that challenge traditional architecture.",
      "example_cn": "这座建筑的外立面具有毕加索式风格，棱角分明的造型与冲突的色彩挑战了传统建筑的规范。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "da Vinci",
      "analysis": "“Da Vinci”（达·芬奇）代表文艺复兴时期全能型天才，强调科学与艺术的完美融合、理性与观察的精确性；而 “Picasso” 更象征现代艺术的颠覆性、情感张力与风格的剧烈转变，代表打破传统、持续创新的艺术家形象。"
    },
    {
      "word_to_compare": "van Gogh",
      "analysis": "“Van Gogh”（梵高）常与强烈的情感表达、主观色彩和精神痛苦联系在一起，其艺术风格以笔触的动感和色彩的象征性著称；而 “Picasso” 则更注重结构的解构与重构，强调形式实验与观念革新，艺术语言更具智性与多变性。"
    },
    {
      "word_to_compare": "warhol",
      "analysis": "“Warhol”（沃霍尔）代表波普艺术，强调大众文化、复制与消费主义，艺术与商业的界限模糊；而 “Picasso” 的创作根植于个人表达与艺术史的对话，虽也涉猎广泛，但始终以艺术本体的探索为核心，更具精英主义与实验性。"
    }
  ]
}