{
  "word": "scottish",
  "pronunciation": "skot·ish",
  "concise_definition": "adj. 苏格兰的, 苏格兰人的, 苏格兰语的",
  "definitions": [
    {
      "pos": "adjective",
      "explanation_en": "Relating to Scotland, its people, culture, language, or traditions; used to describe anything originating from or characteristic of Scotland.",
      "explanation_cn": "与苏格兰、其人民、文化、语言或传统相关的；用于描述任何源自苏格兰或具有苏格兰特征的事物。",
      "example_en": "She wore a traditional Scottish kilt to the festival.",
      "example_cn": "她在节日上穿了一条传统的苏格兰短裙。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Denoting the Gaelic or Scots language spoken in Scotland, or a distinctive accent or dialect associated with Scotland.",
      "explanation_cn": "指在苏格兰使用的盖尔语或苏格兰语，或与苏格兰相关的独特口音或方言。",
      "example_en": "He spoke with a strong Scottish accent after living in Edinburgh for ten years.",
      "example_cn": "他在爱丁堡住了十年后，说话带有浓重的苏格兰口音。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Referring to characteristics such as frugality, resilience, or a strong sense of national identity often stereotypically associated with Scottish people.",
      "explanation_cn": "指常被刻板地与苏格兰人联系在一起的特质，如节俭、坚韧或强烈的民族认同感。",
      "example_en": "The Scottish work ethic is widely respected in international business.",
      "example_cn": "苏格兰人的工作伦理在国际商业中广受尊重。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "british",
      "analysis": "“British”（英国的）指整个联合王国（包括英格兰、苏格兰、威尔士和北爱尔兰）的属性，是一个更广泛的国家概念。而 “Scottish” 仅特指苏格兰，是英国的一部分，具有独特的语言、文化和历史背景，不能与 “British” 混用。例如，一个苏格兰人可以是英国人，但不一定是英国主流文化的一部分。"
    },
    {
      "word_to_compare": "irish",
      "analysis": "“Irish”（爱尔兰的）指爱尔兰共和国或北爱尔兰的文化与民族特征，与苏格兰虽同属凯尔特文化圈，但语言（爱尔兰语 vs 盖尔语）、历史（如独立运动）和传统（如风笛类型、节日）均有显著差异。两者常被混淆，但地理和政治归属完全不同。"
    },
    {
      "word_to_compare": "highland",
      "analysis": "“Highland”（高地的）是苏格兰地理区域的专称，特指苏格兰北部和西部的山区，其文化（如氏族制度、盖尔语）是苏格兰文化的重要组成部分，但并非全部。而 “Scottish” 是涵盖全国的总称，包括低地（Lowland）地区，后者语言更接近英语，文化也更受英格兰影响。因此，“Highland” 是 “Scottish” 的一个子集。"
    }
  ]
}
