{
  "word": "somalia",
  "pronunciation": "soh·muh·lee·uh",
  "concise_definition": "n. 索马里（非洲国家）",
  "forms": {
    "proper_noun": "Somalia"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A country located in the Horn of Africa, bordered by Ethiopia, Kenya, and Djibouti, with a long coastline along the Indian Ocean and the Gulf of Aden. It has a rich cultural heritage rooted in Somali language, Islam, and nomadic traditions, but has faced prolonged political instability and conflict since the early 1990s.",
      "explanation_cn": "位于非洲之角的一个国家，东临印度洋和亚丁湾，与埃塞俄比亚、肯尼亚和吉布提接壤。拥有以索马里语、伊斯兰教和游牧传统为核心的丰富文化遗产，但自20世纪90年代初以来长期面临政治动荡与冲突。",
      "example_en": "The international community has provided humanitarian aid to Somalia for decades due to famine and civil unrest.",
      "example_cn": "由于饥荒和内乱，国际社会几十年来一直向索马里提供人道主义援助。"
    },
    {
      "pos": "noun",
      "explanation_en": "The Somali people or the collective identity of the ethnic Somali population, who share a common language, culture, and historical background across the Horn of Africa and diaspora communities.",
      "explanation_cn": "指索马里民族或索马里族群的集体身份，他们共享一种共同的语言、文化与历史背景，分布于非洲之角及海外侨民社区中。",
      "example_en": "Somalia has a strong oral tradition, with poetry playing a central role in preserving history and social values.",
      "example_cn": "索马里人有着深厚的口头传统，诗歌在保存历史与社会价值观方面起着核心作用。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "somaliland",
      "analysis": "“Somaliland”（索马里兰）是索马里西北部一个自1991年以来单方面宣布独立的地区，虽拥有自己的政府和宪法，但未被国际社会普遍承认为主权国家。它与 “Somalia” 的区别在于政治地位：Somalia 是联合国承认的主权国家，而 Somaliland 是其境内一个未获广泛承认的自治实体。"
    },
    {
      "word_to_compare": "ethiopia",
      "analysis": "“Ethiopia”（埃塞俄比亚）是索马里的邻国，位于其北部，是非洲唯一从未被殖民的国家之一，拥有独特的基督教传统和阿姆哈拉语文化。与索马里以伊斯兰教和游牧文化为主不同，埃塞俄比亚以农业文明和多民族联邦制为特征，两者在宗教、语言和历史发展路径上差异显著。"
    },
    {
      "word_to_compare": "djibouti",
      "analysis": "“Djibouti”（吉布提）是索马里西北部的邻国，面积小但战略地位重要，拥有多个外国军事基地。虽然两国共享索马里族裔和伊斯兰文化，但吉布提是稳定的单一民族主导国家，政治体制相对稳定，而索马里长期处于国家建构失败状态，形成鲜明对比。"
    }
  ]
}