{
  "word": "sussex",
  "pronunciation": "suhk-suhx",
  "concise_definition": "n. 英格兰东南部的一个郡，历史名称；也指该地区的居民或文化",
  "forms": {
    "plural": "sussexes"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A historic county in southeastern England, known for its rolling hills, coastal towns, and rich cultural heritage, including the birthplace of the English seaside resort tradition.",
      "explanation_cn": "英格兰东南部的一个历史悠久的郡，以其连绵的丘陵、海滨城镇和丰富的文化遗产而闻名，包括英国海滨度假传统的发源地。",
      "example_en": "The village of Rye, located in Sussex, is famous for its medieval architecture and cobblestone streets.",
      "example_cn": "位于苏塞克斯的里镇以其中世纪建筑和鹅卵石街道而闻名。"
    },
    {
      "pos": "noun",
      "explanation_en": "A person originating from or associated with the county of Sussex, often carrying regional pride in local dialect, traditions, or identity.",
      "explanation_cn": "指来自或与苏塞克斯郡有关的人，常带有对当地方言、传统或身份的地域自豪感。",
      "example_en": "As a true Sussex native, she speaks with the distinctive local accent and knows every legend of the South Downs.",
      "example_cn": "作为一名真正的苏塞克斯本地人，她操着独特的当地口音，熟知南丘陵的每一个传说。"
    },
    {
      "pos": "noun",
      "explanation_en": "A cultural or symbolic reference to the region of Sussex, often evoked in literature, art, or regional branding (e.g., the Sussex flag or the Sussex martlet).",
      "explanation_cn": "指对苏塞克斯地区的文化或象征性引用，常在文学、艺术或区域品牌中被唤起（如苏塞克斯旗帜或苏塞克斯斑鸠）。",
      "example_en": "The Sussex martlet, a heraldic bird without feet, appears on the county’s coat of arms and symbolizes constant movement and resilience.",
      "example_cn": "苏塞克斯斑鸠——一种无足的纹章鸟——出现在该郡的徽章上，象征着永不停歇的行动力与韧性。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "county",
      "analysis": "“County”（郡）是一个通用行政地理单位，适用于英国、美国等多个国家，泛指地方行政区划。而 “Sussex” 是一个特定的、具有深厚历史和文化内涵的郡名，承载着独特的地域认同，不能简单等同于普通意义上的“郡”。"
    },
    {
      "word_to_compare": "region",
      "analysis": "“Region”（地区）是更宽泛、非正式的地理或文化区域概念，边界模糊，如“南英格兰”或“湖区”。“Sussex” 虽常被称作一个地区，但它是一个有明确历史边界、法定地位和官方象征（如旗帜、徽章）的正式郡名，比一般“region”更具制度性和历史深度。"
    },
    {
      "word_to_compare": "shire",
      "analysis": "“Shire” 是英格兰传统郡的旧称，常用于地名后缀（如 Hampshire、Yorkshire），与 “Sussex” 同属历史郡制。但 “Sussex” 本身已不带 “-shire” 后缀，是少数保留古英语形式的郡名之一（源自古英语 “Sūþsēaxe”，意为“南撒克逊人之地”），因此它在语言学上更具原始性，而 “shire” 更多是后缀形式。"
    }
  ]
}