{
  "word": "through",
  "pronunciation": "throo",
  "concise_definition": "prep. 穿过, 通过; adv. 完全地, 彻底地, 从头到尾",
  "forms": {
    "no_plural_or_inflected_forms": true
  },
  "definitions": [
    {
      "pos": "preposition",
      "explanation_en": "Moving from one side or end of something to the other, indicating physical passage or traversal.",
      "explanation_cn": "表示从某物的一侧或一端移动到另一侧或另一端，强调物理上的穿越或通过。",
      "example_en": "She walked through the forest to reach the lake.",
      "example_cn": "她穿过森林到达了湖边。"
    },
    {
      "pos": "preposition",
      "explanation_en": "Indicating the means or medium by which something is accomplished or experienced, such as a system, process, or channel.",
      "explanation_cn": "表示通过某种方式、媒介、系统或渠道完成或经历某事。",
      "example_en": "We communicated through email because the phone line was down.",
      "example_cn": "由于电话线路中断，我们通过电子邮件联系。"
    },
    {
      "pos": "preposition",
      "explanation_en": "Indicating duration or continuation from beginning to end of a period of time.",
      "explanation_cn": "表示从某一时间段的开始到结束的持续过程。",
      "example_en": "He worked through the night to finish the report.",
      "example_cn": "他通宵工作以完成报告。"
    },
    {
      "pos": "adverb",
      "explanation_en": "From beginning to end; completely or fully, often implying completion or exhaustion.",
      "explanation_cn": "从头到尾；完全地、彻底地，常暗示完成或耗尽。",
      "example_en": "I read the book through in one sitting.",
      "example_cn": "我一口气把这本书读完了。"
    },
    {
      "pos": "adverb",
      "explanation_en": "To or toward the other side; continuing onward to the end of a process or journey.",
      "explanation_cn": "到达或朝向另一侧；继续向前直至过程或旅程的终点。",
      "example_en": "The train went through the tunnel and kept going.",
      "example_cn": "火车穿过了隧道，继续前行。"
    },
    {
      "pos": "adverb",
      "explanation_en": "In a state of completion or finality, often used in phrases like 'get through' or 'see through'.",
      "explanation_cn": "表示完成或终结的状态，常用于短语如 'get through'（熬过）或 'see through'（坚持到底）。",
      "example_en": "She finally saw the project through despite the challenges.",
      "example_cn": "尽管面临挑战，她最终还是把项目坚持到底了。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "across",
      "analysis": "“Across”（横过）强调从一边到另一边的横向跨越，通常用于平面或表面，如过马路、跨河。而 “through” 强调在三维空间中穿过内部，如穿过隧道、森林或人群，暗示被包围或穿行于内部。"
    },
    {
      "word_to_compare": "via",
      "analysis": "“Via”（经由）专指通过某种路径、路线或中介，常用于交通或通信方式，语气更正式。例如 “We traveled via Paris.” 而 “through” 更通用，可指物理穿越、媒介或时间延续，语义范围更广。"
    },
    {
      "word_to_compare": "thoroughly",
      "analysis": "“Thoroughly”（彻底地）是 “through” 作为副词时的形容词化形式，专用于强调完整性或细致性，如 “thoroughly cleaned”。而 “through” 作为副词时更侧重于过程的完成（如 read through），不强调细节，仅强调从头到尾。"
    }
  ]
}