{
  "word": "william",
  "pronunciation": "wil·ee·uhm",
  "concise_definition": "n. 威廉（男性名）",
  "forms": {
    "variant_spellings": [
      "Wilhelm",
      "Guillaume"
    ]
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A masculine given name of Germanic origin, derived from the elements 'wil' (will, desire) and 'helm' (helmet, protection), meaning 'resolute protector' or 'strong-willed warrior'. It has been widely used in European royalty and remains a common first name in English-speaking countries.",
      "explanation_cn": "源自日耳曼语的男性名，由 'wil'（意志、愿望）和 'helm'（头盔、保护）组成，意为‘坚定的保护者’或‘意志坚强的战士’。该名字在欧洲王室中广泛使用，至今仍是英语国家常见的男性名字。",
      "example_en": "William Shakespeare is one of the most influential playwrights in the English language.",
      "example_cn": "威廉·莎士比亚是英语文学中最具影响力的剧作家之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A surname or family name borne by numerous notable individuals, including historical figures, artists, and public figures.",
      "explanation_cn": "作为姓氏，被众多知名人物使用，包括历史人物、艺术家和公众人物。",
      "example_en": "William Wordsworth was a leading poet of the Romantic movement in England.",
      "example_cn": "威廉·华兹华斯是英国浪漫主义运动的主要诗人之一。"
    },
    {
      "pos": "noun",
      "explanation_en": "A common name for monarchs in British history, such as King William I, II, III, and IV, often associated with pivotal moments in English constitutional development.",
      "explanation_cn": "英国历史上多位君主的常用名，如威廉一世、二世、三世和四世，常与英国宪政发展的关键时期相关联。",
      "example_en": "William the Conqueror became King of England after the Battle of Hastings in 1066.",
      "example_cn": "征服者威廉在1066年的黑斯廷斯战役后成为英格兰国王。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "will",
      "analysis": "“Will”（意志、意愿）是名词或动词，表示决心、愿望或法律文件（遗嘱），与 “William” 仅在词源上相关（William 源自 will + helm），但二者语义完全不同。前者是抽象概念，后者是专有名词。"
    },
    {
      "word_to_compare": "wilhelm",
      "analysis": "“Wilhelm” 是 “William” 的德语拼写形式，发音和含义完全相同，仅因语言文化差异而拼写不同。在德语国家（如德国、奥地利）更常用，而 “William” 是英语国家的标准形式。"
    },
    {
      "word_to_compare": "guy",
      "analysis": "“Guy”（家伙、男人）是英语中对普通男性的非正式称呼，语气随意，无历史或贵族色彩。而 “William” 是正式的个人姓名，承载历史、文化与社会地位的象征，常用于正式场合或历史语境中。"
    }
  ]
}