{
  "word": "yorkshire",
  "pronunciation": "yohrk·sheer",
  "concise_definition": "n. 约克郡（英国地名）, adj. 约克郡的",
  "forms": {
    "proper_noun": "Yorkshire"
  },
  "definitions": [
    {
      "pos": "noun",
      "explanation_en": "A historic county in northern England, known for its rolling hills, moorlands, traditional dialect, and cultural heritage including Yorkshire pudding and tea culture.",
      "explanation_cn": "英国北部的一个历史悠久的郡，以其连绵的丘陵、荒原、传统方言以及包括约克郡布丁和茶文化在内的文化遗产而闻名。",
      "example_en": "She grew up in the heart of Yorkshire, where the accent is thick and the pubs are warm.",
      "example_cn": "她在约克郡的核心地带长大，那里口音浓重，酒馆温暖宜人。"
    },
    {
      "pos": "adjective",
      "explanation_en": "Relating to or originating from Yorkshire, often used to describe regional characteristics such as food, dialect, or people.",
      "explanation_cn": "与约克郡相关或源自约克郡的，常用于描述该地区的食物、方言或居民特征。",
      "example_en": "He loves a good Yorkshire pudding with his Sunday roast.",
      "example_cn": "他喜欢在周日烤肉时吃上一份地道的约克郡布丁。"
    },
    {
      "pos": "noun",
      "explanation_en": "A breed of large, hardworking draft horse originally from Yorkshire, known for its strength and gentle temperament.",
      "explanation_cn": "一种原产于约克郡的大型挽马品种，以力量强大和性情温顺著称。",
      "example_en": "The farmer relied on his trusty Yorkshire to pull the plow across the field.",
      "example_cn": "农夫依靠他那匹可靠的约克郡马在田里拉犁。"
    }
  ],
  "comparison": [
    {
      "word_to_compare": "lancashire",
      "analysis": "“Lancashire”（兰开夏）是英格兰西北部的另一个历史郡，与约克郡相邻，两者都以工业革命时期的纺织业闻名，但兰开夏更以棉纺和曼彻斯特为中心，而约克郡则以羊毛、农业和乡村文化著称。语言上，约克郡口音更粗犷，兰开夏口音则更柔和。"
    },
    {
      "word_to_compare": "northern",
      "analysis": "“Northern”（北方的）是一个泛指英格兰北部地区的形容词，涵盖多个郡如约克郡、兰开夏、达勒姆等。而 “Yorkshire” 是一个具体的地理和文化实体，具有独特的历史、方言和传统，不能被 “northern” 完全替代。使用 “Yorkshire” 时，往往带有强烈的地方认同感。"
    },
    {
      "word_to_compare": "geordie",
      "analysis": "“Geordie” 指的是英格兰东北部泰恩赛德地区（如纽卡斯尔）的居民及其方言，与约克郡虽同属北方，但文化、口音和身份认同截然不同。约克郡人常以直率、务实著称，而盖尔迪人则以幽默感和强烈的社区归属感闻名。两者在英国文化中是并列但独立的地域标签。"
    }
  ]
}